# Module 1.2 Exercises - Explore Data

### Exercise 1:
Use the pandas library to read in the file "travel_times.csv" as a dataframe. Set the dataframe's variable name as `travel_df`.

*Note*: The file is located in your datasets folder.

In [1]:
# first import the pandas library in order to make a dataframe
import pandas as pd

In [2]:
# set the path to the file as a string
filepath = "datasets/travel_times.csv"

In [3]:
# use the .read_csv function to read the information in the file
# then format the info as a dataframe
travel_df = pd.read_csv(filepath)

In [4]:
# show first 5 rows of dataframe
travel_df.head()

,Date,StartTime,DayOfWeek,GoingTo,Distance,MaxSpeed,AvgSpeed,AvgMovingSpeed,FuelEconomy,TotalTime,MovingTime,Take407All,Comments
0,1/6/2012,16:37,Friday,Home,51.29,127.4,78.3,84.8,NaN,39.3,36.3,No,NaN
1,1/6/2012,8:20,Friday,GSK,51.63,130.3,81.8,88.9,NaN,37.9,34.9,No,NaN
2,1/4/2012,16:17,Wednesday,Home,51.27,127.4,82.0,85.8,NaN,37.5,35.9,No,NaN
3,1/4/2012,7:53,Wednesday,GSK,49.17,132.3,74.2,82.9,NaN,39.8,35.6,No,NaN
4,1/3/2012,18:57,Tuesday,Home,51.15,136.2,83.4,88.1,NaN,36.8,34.8,No,NaN

### Exercise 2:

Use the pandas library to read in the file "income_expenses.xlsx" as a dataframe. Set the dataframe's variable name as `expense_df`.

*Note*: The file is located in your datasets folder.

In [5]:
# set path to file as a string
filepath = "datasets/income_expenses.xlsx"

In [6]:
# use the .read_excel function to bring info in as dataframe
expense_df = pd.read_excel(filepath)

In [7]:
#show first 5 rows of dataframe
expense_df.head()

  Income Range                    Category  Amount Class_level
0     $100-200                        Rent   26.43        Poor
1     $100-200                        Food   59.81        Poor
2     $100-200                     Clothes   38.95        Poor
3     $100-200                       Taxes    0.14        Poor
4     $100-200  Other Expenses and Savings   13.77        Poor

### Exercise 3:
Using the lists in the cell below, write code that will zip up the lists and make them into one list, then turn it into a dataframe. Next, export the dataframe as a csv file. Then try exporting the dataframe as an Excel file.

In [8]:
brands = ['Nike','Adidas','New Balance','Puma','Reebok']
prices = [176,59,47,38,99]

In [9]:
shoes_ls = list(zip(brands, prices))

In [10]:
shoes_df = pd.DataFrame(shoes_ls, columns=['Brands', 'Prices'])
shoes_df.head()

        Brands  Prices
0         Nike     176
1       Adidas      59
2  New Balance      47
3         Puma      38
4       Reebok      99

In [11]:
shoes_df.to_csv("shoes.csv")

In [12]:
writer = pd.ExcelWriter("shoes.xlsx", engine="xlsxwriter")
shoes_df.to_excel(writer, sheet_name='Sheet 1')
writer.save()

### Exercise 4:

What columns are in the `travel_df` dataframe? What columns are in the `expense_df` dataframe?

In [13]:
travel_df.columns

Index(['Date', 'StartTime', 'DayOfWeek', 'GoingTo', 'Distance', 'MaxSpeed',
       'AvgSpeed', 'AvgMovingSpeed', 'FuelEconomy', 'TotalTime', 'MovingTime',
       'Take407All', 'Comments'],
      dtype='object')

In [14]:
expense_df.columns

Index(['Income Range', 'Category', 'Amount', 'Class_level'], dtype='object')

### Exercise 5:

Using the `expense_df` dataframe, sum the expense amount by income range using the `.groupby()` function .

In [15]:
expense_df.groupby('Income Range')['Amount'].sum()

Income Range
$100-200      139.10
$1000+       1125.00
$200-300      249.45
$300-400      335.68
$400-500      433.82
$500-750      557.00
$750-1000     880.00
Name: Amount, dtype: float64

### Exercise 6:

Using the `travel_df` dataframe and `.pivot_table()` function, get the average total time by day of the week and direction traveled (Home/GSK).

In [16]:
travel_df.pivot_table(index=['DayOfWeek', 'GoingTo'], values=['TotalTime'])

                   TotalTime
DayOfWeek GoingTo
Friday    GSK      37.628571
          Home     38.238462
Monday    GSK      44.747368
          Home     41.725000
Thursday  GSK      40.204167
          Home     42.345000
Tuesday   GSK      42.079167
          Home     42.962500
Wednesday GSK      42.087500
          Home     44.300000

### Exercise 7:

Choose either the `travel_df` or `expense_df` and do some exploratory analysis.

In [17]:
# the mean and median (50%) is similar across all numerical columns in the dataset
# this means that the data seems to be normally distributed and there are no extreme outliers
travel_df.describe()

,Distance,MaxSpeed,AvgSpeed,AvgMovingSpeed,FuelEconomy,TotalTime,MovingTime
count,205.000000,205.000000,205.000000,205.000000,186.000000,205.000000,205.000000
mean,50.981512,127.591707,74.477561,81.975610,8.690591,41.904390,37.871707
std,1.321205,4.128450,11.409816,10.111544,0.504971,6.849476,4.835072
min,48.320000,112.200000,38.100000,50.300000,7.810000,28.200000,27.100000
25%,50.650000,124.900000,68.900000,76.600000,8.370000,38.400000,35.700000
50%,51.140000,127.400000,73.600000,81.400000,8.520000,41.300000,37.600000
75%,51.630000,129.800000,79.900000,86.000000,8.970000,44.400000,39.900000
max,60.320000,140.900000,107.700000,112.100000,10.050000,82.300000,62.400000

In [18]:
# the mean and median are vastly different (mean > median)
# this means that the mean is being skewed by extremely high values in the data
expense_df.describe()

           Amount
count   35.000000
mean   106.287143
std    120.399752
min      0.000000
25%     31.890000
50%     65.070000
75%    152.425000
max    568.130000